arduino/ArduinoCore-mbed/boards.txt
##############################################################

stm32f429.name=STM32F429 Mbed target
stm32f429.build.core=arduino
stm32f429.build.crossprefix=arm-none-eabi-
stm32f429.build.compiler_path={runtime.tools.arm-none-eabi-gcc.path}/bin/

stm32f429.build.variant=DISCO_F429ZI
stm32f429.build.mcu=cortex-m4
stm32f429.build.extra_flags=
stm32f429.build.architecture=cortex-m4
stm32f429.build.board=DISCO_F429ZI
stm32f429.build.ldscript=linker_script.ld
stm32f429.compiler.mbed.defines=@{build.variant.path}/defines.txt
stm32f429.compiler.mbed.ldflags=@{build.variant.path}/ldflags.txt
stm32f429.compiler.mbed.cflags=@{build.variant.path}/cflags.txt
stm32f429.compiler.mbed.cxxflags=@{build.variant.path}/cxxflags.txt
stm32f429.compiler.mbed.includes=${build.variant.path}/includes.txt
stm32f429.compiler.mbed.extra_ldflags=-Wl,--start-group -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys -Wl,--end-group -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
stm32f429.compiler.mbed={build.variant.path}/libs/libmbed.a
stm32f429.vid.0=0x8087
stm32f429.pid.0=0x101f

stm32f429.upload.via_ssh=true
stm32f429.upload.tool=openocd
stm32f429.upload.protocol=sam-ba
stm32f429.upload.config=-f interface/stlink-v2.cfg -f target/stm32f4x_stlink.cfg
stm32f429.upload.maximum_size=10000000
stm32f429.upload.use_1200bps_touch=false
stm32f429.upload.wait_for_upload_port=false
stm32f429.upload.native_usb=false

##############################################################

odinw2.name=ODINW2 Mbed target
odinw2.build.core=arduino
odinw2.build.crossprefix=arm-none-eabi-
odinw2.build.compiler_path={runtime.tools.arm-none-eabi-gcc.path}/bin/

odinw2.build.variant=MTB_UBLOX_ODIN_W2
odinw2.build.mcu=cortex-m4
odinw2.build.extra_flags=
odinw2.build.architecture=cortex-m4
odinw2.build.board=MTB_UBLOX_ODIN_W2
odinw2.build.ldscript=linker_script.ld
odinw2.compiler.mbed.defines=@{build.variant.path}/defines.txt
odinw2.compiler.mbed.ldflags=@{build.variant.path}/ldflags.txt
odinw2.compiler.mbed.cflags=@{build.variant.path}/cflags.txt
odinw2.compiler.mbed.cxxflags=@{build.variant.path}/cxxflags.txt
odinw2.compiler.mbed.includes=${build.variant.path}/includes.txt
odinw2.compiler.mbed.extra_ldflags=-Wl,--start-group -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys -Wl,--end-group -lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
odinw2.compiler.mbed={build.variant.path}/libs/libmbed.a
odinw2.vid.0=0x8087
odinw2.pid.0=0x101f

odinw2.upload.via_ssh=true
odinw2.upload.tool=openocd
odinw2.upload.config=-f interface/stlink-v2.cfg -f target/stm32f4x_stlink.cfg
odinw2.upload.protocol=sam-ba
odinw2.upload.maximum_size=10000000
odinw2.upload.use_1200bps_touch=false
odinw2.upload.wait_for_upload_port=false
odinw2.upload.native_usb=false

###############################################################